<a href="https://colab.research.google.com/github/rajasreekalli/datascience-dojo/blob/main/Titanic_dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [227]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [228]:
import pandas as pd

In [229]:
filename = '/content/drive/MyDrive/titanic.csv'
df = pd.read_csv(filename)
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [230]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [231]:
total_passengers = df['Survived'].count()
total_survived = df['Survived'].sum()
total_survived_percen = (total_survived/total_passengers) * 100
total_survived_percen

38.38383838383838

In [232]:
total_male = df['Sex'] == 'male'
total_female = df['Sex'] == 'female'
survived = df['Survived'] == 1

In [233]:
male_survived = df.loc[survived & total_male,:]
male_survived

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
17            18         1       2  ...  13.0000   NaN         S
21            22         1       2  ...  13.0000   D56         S
23            24         1       1  ...  35.5000    A6         S
36            37         1       3  ...   7.2292   NaN         C
55            56         1       1  ...  35.5000   C52         S
..           ...       ...     ...  ...      ...   ...       ...
838          839         1       3  ...  56.4958   NaN         S
839          840         1       1  ...  29.7000   C47         C
857          858         1       1  ...  26.5500   E17         S
869          870         1       3  ...  11.1333   NaN         S
889          890         1       1  ...  30.0000  C148         C

[109 rows x 12 columns]

In [234]:
female_survived = df.loc[survived & total_female,:]
female_survived

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
8              9         1       3  ...  11.1333   NaN         S
9             10         1       2  ...  30.0708   NaN         C
..           ...       ...     ...  ...      ...   ...       ...
874          875         1       2  ...  24.0000   NaN         C
875          876         1       3  ...   7.2250   NaN         C
879          880         1       1  ...  83.1583   C50         C
880          881         1       2  ...  26.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S

[233 rows x 12 columns]

In [248]:
Fare = df['Fare'] < 10
Final_fare = df.loc[Fare, :]
print(Final_fare)

     PassengerId  Survived  Pclass  ...    Fare Cabin  Embarked
0              1         0       3  ...  7.2500   NaN         S
2              3         1       3  ...  7.9250   NaN         S
4              5         0       3  ...  8.0500   NaN         S
5              6         0       3  ...  8.4583   NaN         Q
12            13         0       3  ...  8.0500   NaN         S
..           ...       ...     ...  ...     ...   ...       ...
877          878         0       3  ...  7.8958   NaN         S
878          879         0       3  ...  7.8958   NaN         S
881          882         0       3  ...  7.8958   NaN         S
884          885         0       3  ...  7.0500   NaN         S
890          891         0       3  ...  7.7500   NaN         Q

[336 rows x 12 columns]

In [265]:
survived_less_10 = Final_fare['Survived']==1
total_surv_less_10 = survived_less_10.sum()
total_survived_percen_less_10 = (total_surv_less_10/total_survived) * 100
total_survived_percen_less_10

19.5906432748538

In [237]:
not_survived = df['Survived'] == 0
not_surv = df.loc[not_survived, :]
not_surv['Age'].mean()

30.62617924528302

In [238]:
survived = df['Survived'] == 1
surv = df.loc[survived, :]
surv['Age'].mean()

28.343689655172415

In [239]:
male_survived['Age'].mean()

27.276021505376345

In [240]:
female_survived['Age'].mean()

28.84771573604061